<?php

namespace Faker\Provider\zh_CN;

class Person extends \Faker\Provider\Person
{
	protected static $formats = array(
		'{{firstName}}{{lastName}}',
		'{{firstName}}{{lastName}}',
		'{{firstName}}{{lastName}}',
		'{{firstName}}{{lastName}}',
		'{{firstName}}{{lastName}}',
        '{{firstName}}{{suffix}}',
	);
	
	protected static $firstName = array(
        '阿', '阿单', '阿跌', '阿伏干', '阿贺', '阿会', '阿勒根', '阿里', '阿鹿桓', '阿仑', '阿罗', '阿热', '阿史德', '阿史那', '阿思没', '阿勿嘀', '阿逸多', '哀', '哀骀', '蔼', '霭', '艾', '艾岁', '爱', '爱新觉罗', '暧', '安', '安迟', '安都', '安国', '安金', '安陵', '安平', '安期', '安丘', '安是', '安阳', '俺', '犴', '岸', '按', '昂', '盎', '卬', '敖', '奥', '奥敦', '奥鲁', '奥屯', '傲', '八', '巴', '巴公', '仈', '芭', '跋', '拔', '拔拔', '拔列',
        '拔列兰', '拔略', '拔也', '把', '把利', '罢', '罢敌', '霸', '白', '白狄', '白公', '白侯', '白鹿', '白鸾', '白马', '白冥', '白男', '白象', '白亚', '白杨提', '白乙', '百', '百里', '柏', '柏常', '柏高', '柏侯', '摆', '拜', '班', '班丘', '般', '阪',
        '阪泉', '阪上', '半', '办', '滨', '邦', '榜', '棒', '包', '苞', '苞丘', '褒', '雹', '保', '葆', '宝', '堡', '饱', '抱', '豹', '报', '暴', '鲍', '鲍丘', '鲍俎', '瀑', '杯', '卑', '卑梁', '卑徐', '悲', '碑', '北方', '北', '北宫', '北郭', '北海', '北旄', '北门', '北丘', '北人',
        '北唐', '北乡', '北殷', '北野', '贝', '倍', '倍俟', '孛', '孛术鲁', '邶', '背', '被', '备', '贲', '奔', '本', '崩', '伻', '甭', '泵', '逼', '鼻', '比', '比丘', '比人', '笔', '鄙', '彼', '必', '邲', '毕', '秘', '苾', '苾悉', '庇', '闭', '闭珊', '敝', '辟', '辟闾', '壁', '璧', '碧',
        '弼', '边', '编', '扁', '卞', '弁', '鴘', '汴', '变', '便', '辨', '辩', '标', '彪', '麃', '表', '鳖', '别', '宾', '宾牟', '彬', '邠', '斌', '滨', '冰', '兵', '丙', '邴', '炳', '秉', '禀', '并', '并官', '波', '波斯', '剥', '拨略', '钵', '伯', '伯比', '伯常', '伯成', '伯德', '伯封', '伯丰',
        '伯高', '伯昏', '伯暋', '伯夏', '伯有', '伯州', '伯宗', '泊', '帛', '博', '勃', '驳马', '僰', '薄', '薄姑', '薄奚', '薄野', '亳', '卜', '卜成', '卜梁', '卜马', '捕', '补', '布雅穆齐', '布', '布叔满', '部', '步', '步大汗',
        '步六孤', '步鹿根', '步叔', '步扬', '步温', '簿', '岑', '种', '陈', '成', '程', '崔', '翠', '蔡', '庄', '曹', '车', '丛', '淳于', '晁', '巢', '单于', '常', '场', '厂', '策', '臣', '琮',
        '崇侯', '崇', '迟', '池', '楚', '储', '褚', '除', '春', '出', '柴', '操', '大', '但', '丁', '党', '登徒', '邓', '刁', '戴', '都', '毒', '独孤', '杜', '窦', '东门', '东', '东方', '东郭', '董', '狄', '邸', '第一', '第二', '第三', '第四',
        '第五', '第六', '第七', '第八', '端', '端木', '段', '多', '电', '刀', '尔', '法', '樊', '范', '范姜', '方', '房', '费', '风', '封', '冯', '福', '扶', '符', '富察', '傅其', '傅余', '父', '傅', '付', '不', '棼冒', '鼢冒', '公都', '龚',
        '公西', '公羊', '公冶', '公孙', '干', '甘', '淦', '哥舒', '戈', '葛', '盖', '高阳', '高', '耿', '更', '苟', '辜', '古口引', '穀梁', '顾', '瓜尔佳', '官', '关', '管', '郭', '国', '过', '妫', '归海', '归', '鬼', '桂', '刚', '哈', '何', '河', '和', '贺', '赫舍里', '黑', '洪', '呼',
        '呼延', '忽仑', '胡', '虎', '宦', '黄', '侯', '候', '华', '花', '桓', '郝', '浩', '浑', '韩', '罕', '翚', '海', '火拔', '霍', '鸡', '姬', '冀', '籍', '吉', '姞', '己', '季孙', '济', '计', '纪', '季', '简',
        '建', '江', '姜', '蒋', '焦', '金', '靳', '晋', '京', '经孙', '荆', '景', '井', '敬', '居', '鞠', '瞿', '剧', '具', '家', '隽', '九吾', '救', '阚', '康', '开', '柯', '空桑', '空同', '空桐', '崆峒', '空相', '孔', '寇', '匡', '邝', '旷', '况', '蒯', '昆', '乐', '冷', '黎', '李', '栗', '厉', '利', '力', '留', '刘', '柳', '泠', '令狐', '劳', '老', '卢', '鲁', '鹿', '陆费', '陆',
        '路', '甪里', '闾丘', '吕', '廖', '林', '蔺', '栾', '梁', '楼', '郎佳', '狼', '稂', '连', '练', '罗', '骆', '蓝', '兰', '赖', '雷', '龙', '娄', '麻', '马', '买', '麦', '满',
        '蔄', '莽', '茅', '毛', '茆', '媢', '冒', '茂', '没路真', '枚', '梅', '门', '蒙山', '蒙', '孟孙', '孟', '弥', '祢', '糜', '米', '芈', '弭', '密', '苗', '缪', '闵', '敏', '名', '明', '莫那娄', '墨胎', '万俟', '莫', '墨', '默', '牟', '母', '幕', '木', '沐', '慕', '慕容', '穆', '纳喇', '那拉', '纳兰', '那', '纳', '迺', '佴', '南方', '南门', '南郭', '南', '南宫', '难', '倪', '泥', '年', '念', '粘', '乜', '聂', '宁', '牛', '钮', '钮祜禄', '农', '侬', '能', '区', '欧', '欧阳', '潘', '盘', '泮', '傍', '庞', '逄', '胖', '裴', '彭', '邳', '皮', '朴', '品', '平', '繁', '破落那', '朴', '蒲', '濮', '普六茹', '浦', '普', '溥', '杷', '漆雕', '戚', '漆', '亓', '齐', '祁', '岐', '奇', '祈', '綦', '蕲', '麒', '乞伏', '乞', '杞', '启', '千', '钱', '强', '乔', '桥', '谯', '且', '郄', '钦', '秦', '琴', '覃', '勤', '青', '卿', '清', '庆', '丘', '秋', '邱', '仇', '求', '裘', '曲沃', '曲', '屈', '诎', '璩', '渠', '蘧', '权', '全', '泉', '阙', '让', '任', '荣', '如', '如皋冒', '茹', '阮', '饶', '戎', '容', '冉', '珊', '山', '单', '上官', '佘', '莘', '申', '申屠', '神农', '沈', '绳', '冼', '盛', '施', '石', '时', '史', '是', '世', '舒', '殳', '叔敖', '叔梁', '叔孙', '水', '司', '司马', '司徒', '司空', '死', '宋', '苏', '素黎', '粟', '隋', '索绰罗', '孙', '桑', '沙', '帅', '萨', '萨穆希尔', '台', '邰', '澹台', '谭', '檀', '谈', '汤', '唐', '陶', '滕', '田', '佟', '童', '脱', '脱脱', '庹', '拓拔', '秃发', '涂', '凃', '完颜', '万', '汪', '王', '王子', '文', '闻', '闻人', '翁', '威', '危', '委', '韦', '卫', '魏', '温', '文', '巫', '乌', '邬', '兀', '无终', '吴', '武', '午', '伍', '吾', '勖', '西', '西门', '西方', '西郭', '奚', '袭', '席', '夏', '夏侯', '萧', '肖', '先', '咸', '线', '香', '向', '项', '解', '谢', '忻', '辛', '信', '邢莫', '姓', '幸', '熊', '胥', '徐', '许', '续', '宣', '轩辕', '玄', '薛', '寻', '修', '伊', '弋', '伊尔根觉罗', '移', '易', '鄢', '燕', '颜', '严', '言', '阎', '闫', '晏', '阳', '杨', '杨雷', '幺', '夭', '珧', '姚', '药', '耶律', '叶', '右', '页', '业', '叶赫那拉', '殷', '阴', '银', '尹', '印', '胤', '英', '婴', '营', '嬴', '郢', '应', '游', '尤', '有莘', '有', '于', '余', '虞', '俞', '鱼', '庾', '宇文', '宇', '宇文', '禹', '鬻', '喻', '玉', '育', '裕', '郁', '豫', '聿', '尉迟', '乐', '岳', '月', '云', '允', '袁', '元', '原', '源', '员', '苑', '永', '宰', '载', '昝', '臧', '糟', '迮', '查', '笮', '乍', '曾', '翟', '砦', '祭', '占', '詹', '瞻', '展', '湛', '战', '张廖', '张简', '章', '彰', '张', '掌', '仉', '昭', '招', '肇', '赵', '兆', '召', '甄', '真', '镇', '征', '郑', '正', '政', '支', '职', '直', '植', '掷', '治', '志', '郅', '智', '衷', '钟', '钟', '终', '仲', '周', '朱', '邾', '诸', '竺', '竹', '主', '祝', '颛孙', '专', '庄', '卓', '禚', '资',
        '訾', '紫', '子', '子南', '宗', '纵', '邹', '驺', '祖', '俎', '左', '佐',
	);
	
	protected static $lastName = array(
        '嘉','琼','桂','娣','叶','璧','璐','娅','琦','晶','妍','茜','秋','珊','莎','锦','黛','青','倩','婷','姣','婉','娴','瑾','颖','露','瑶','怡','婵','雁','蓓','纨','仪','荷','丹','蓉','眉','君','琴','蕊','薇','菁','梦','岚','苑','婕','馨','瑗','琰','韵','融','园','艺','咏','卿','聪','澜','纯','毓','悦','昭','冰','爽','琬','茗','羽','希','宁','欣','飘','育','滢','馥','筠','柔','竹','霭','凝','晓','欢','霄','枫','芸','菲','寒','伊','亚','宜','可','姬','舒','影','荔','枝','思','丽','秀','娟','英','华','慧','巧','美','娜','静','淑','惠','珠','翠','雅','芝','玉','萍','红','娥','玲','芬','芳','燕','彩','春','菊','勤','珍','贞','莉','兰','凤','洁','梅','琳','素','云','莲','真','环','雪','荣','爱','妹','霞','香','月','莺','媛','艳','瑞','凡','佳',
	);
	

	private static $suffix = array('先生','女士','小姐');


	/**
	 * @example 'PhD'
	 */
	public static function suffix()
	{
		return static::randomElement(static::$suffix);
	}
}